Column cannot be placed in Elevation or Section view
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InsertColumnViewFailure { get; }
  Visual Basic
Public Shared ReadOnly Property InsertColumnViewFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InsertColumnViewFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ViewFailures Class
  Autodesk.Revit.DB Namespace